mix/benchmark-results/gors-https-apache-proxy-keep-alive-c1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking auerpi.no-ip.biz (be patient).....done


Server Software:        
Server Hostname:        auerpi.no-ip.biz
Server Port:            443
SSL/TLS Protocol:       TLSv1/SSLv3,DHE-RSA-AES256-SHA,2048,256

Document Path:          /gors/storage/shybyte/myfavoritedrinks/green-tea
Document Length:        96 bytes

Concurrency Level:      1
Time taken for tests:   0.770 seconds
Complete requests:      20
Failed requests:        0
Write errors:           0
Keep-Alive requests:    20
Total transferred:      10181 bytes
HTML transferred:       1920 bytes
Requests per second:    25.99 [#/sec] (mean)
Time per request:       38.475 [ms] (mean)
Time per request:       38.475 [ms] (mean, across all concurrent requests)
Transfer rate:          12.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10  46.7      0     209
Processing:    11   28  20.5     17      76
Waiting:        9   17   8.2     16      47
Total:         11   38  47.1     18     219

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     38
  75%     48
  80%     54
  90%     76
  95%    219
  98%    219
  99%    219
 100%    219 (longest request)