mix/benchmark-results/gors-https-apache-proxy-keep-alive.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking auerpi.no-ip.biz (be patient).....done


Server Software:        
Server Hostname:        auerpi.no-ip.biz
Server Port:            443
SSL/TLS Protocol:       TLSv1/SSLv3,DHE-RSA-AES256-SHA,2048,256

Document Path:          /gors/storage/shybyte/myfavoritedrinks/green-tea
Document Length:        96 bytes

Concurrency Level:      10
Time taken for tests:   2.044 seconds
Complete requests:      20
Failed requests:        0
Write errors:           0
Keep-Alive requests:    20
Total transferred:      10183 bytes
HTML transferred:       1920 bytes
Requests per second:    9.79 [#/sec] (mean)
Time per request:       1021.814 [ms] (mean)
Time per request:       102.181 [ms] (mean, across all concurrent requests)
Transfer rate:          4.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  225 550.0      0    1502
Processing:    30   76  40.5     66     159
Waiting:       23   75  41.5     65     159
Total:         30  301 557.7     80    1656

Percentage of the requests served within a certain time (ms)
  50%     80
  66%    118
  75%    121
  80%    159
  90%   1572
  95%   1656
  98%   1656
  99%   1656
 100%   1656 (longest request)