mix/benchmark-results/gors-https-apache-proxy.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking auerpi.no-ip.biz (be patient).....done


Server Software:        
Server Hostname:        auerpi.no-ip.biz
Server Port:            443
SSL/TLS Protocol:       TLSv1/SSLv3,DHE-RSA-AES256-SHA,2048,256

Document Path:          /gors/storage/shybyte/myfavoritedrinks/green-tea
Document Length:        96 bytes

Concurrency Level:      10
Time taken for tests:   3.873 seconds
Complete requests:      20
Failed requests:        0
Write errors:           0
Total transferred:      9460 bytes
HTML transferred:       1920 bytes
Requests per second:    5.16 [#/sec] (mean)
Time per request:       1936.683 [ms] (mean)
Time per request:       193.668 [ms] (mean, across all concurrent requests)
Transfer rate:          2.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      821 1636 237.2   1624    1945
Processing:    45  143  98.4     93     289
Waiting:       29  136  98.8     92     287
Total:        914 1779 236.0   1855    2001

Percentage of the requests served within a certain time (ms)
  50%   1855
  66%   1869
  75%   1881
  80%   1943
  90%   1991
  95%   2001
  98%   2001
  99%   2001
 100%   2001 (longest request)